ГТС/УТГТС/Enums/ТипыОбъектовНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Давалец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаПодПринципала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказМатериаловВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПереработчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПереработчику2_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПроизводство2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПроизводства2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказДавальца2_5</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыОбъектовНазначений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получает предсталение значений перечисления на основном языке.
// Предсталения должны соответствовать синонимам значений
// 
// Параметры:
//  ТипОбъектаНазначения - ПеречислениеСсылка.ТипыОбъектовНазначений - Тип объекта назначения
// 
// Возвращаемое значение:
//  Строка - Тип объекта назначения на основном языке
Функция ТипОбъектаНазначенияНаОсновномЯзыке(ТипОбъектаНазначения) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	ПредставлениеТипаОбъектаНазначения = "";
	
	Если ТипОбъектаНазначения = Давалец Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Давалец'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = Переработчик Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Переработчик'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ДоговорСДавальцем Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Договор с давальцем'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ДоговорСПереработчиком Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Договор с переработчиком'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗакупкаПодПринципала Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Закупка под принципала'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = НаправлениеДеятельности Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Направление деятельности'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказДавальца Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ давальца (2.4)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказДавальца2_5 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ давальца'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказМатериаловВПроизводство Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ материалов в производство'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаСборку Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на сборку (разборку)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаПеремещение Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на перемещение'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаПроизводство Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на производство (2.1)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказПереработчику Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ переработчику (2.4)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказПереработчику2_5 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ переработчику'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаРемонт Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на ремонт'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаВнутреннееПотребление Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на внутреннее потребление'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказКлиента Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ клиента'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаПроизводство2_2 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на производство'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаявкаНаВозвратТоваровОтКлиента Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заявка на возврат товаров от клиента'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЭтапПроизводства2_2 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Этап производства'", КодОсновногоЯзыка);	
	КонецЕсли;	
	
	Возврат ПредставлениеТипаОбъектаНазначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
